// Валидация ссылок при помощи времён жизни

// fn main() {

//     let r;

//     {
//         let x = 5;
//         r = &x; // Времена жизни предотвращают появление "повисших" ссылок.
//     }

//     println!("r: {r}");
// }

// Анализатор заимствований

// fn main() {
//     let r;                // ---------+-- 'a
//                           //          |
//     {                     //          |
//         let x = 5;        // -+-- 'b  |
//         r = &x;           //  |       |
//     }                     // -+       |
//                           //          |
//     println!("r: {r}");   //          |
// }                         // ---------+

fn main() {
    let x = 5;       // ----------+-- 'b
                          //           |
    let r = &x;     // --+-- 'a  |
                          //   |       |
    println!("r: {r}");   //   |       |
                          // --+       |
}                         // ----------+
